src/cf/Catalogs/КонтактныеЛицаПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛицаПартнеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииСвязи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияСвязи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Взаимодействия</Name>
					<Comment>Взаимодействия</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ВладелецБизнеса</Name>
					<Comment>Владелец бизнеса</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Заказчик</Name>
					<Comment>Заказчик</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Ключевой</Name>
					<Comment>Ключевой контакт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ЛичныеИнтересы</Name>
					<Comment>Личные интересы контактного лица</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_НапоминатьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ОтписалсяОтEmailРассылок</Name>
					<Comment>Отписался от Email рассылок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Противник</Name>
					<Comment>Противник</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПроцентЗаполненностиКИ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПроцентЗаполненностиПортрет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Прочее</Name>
					<Comment>Прочее</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_РольКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_Состояние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Спонсор</Name>
					<Comment>Спонсор</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Сторонник</Name>
					<Comment>Сторонник</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ТипОтношенийПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_УчаствуетВАнкетировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Фотография</Name>
					<Comment>Фотография клиента частное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеровПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпCoMagicID</Name>
					<Comment>Идентификатор контакта в системе CoMagic</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпПользовательДляПереключенияЗвонков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогГражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогСобственник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСклонятьФамилию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRM_ОсновнойДляСвязи</Name>
							<Comment>Основной вид контактной информации для связи</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиКонтактногоЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольКонтактногоЛица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CRM_ДополнительнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CRM_ДополнительнаяИнформация</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CRM_КлючевыеСобытия</Name>
					<Comment>Ключевые события контакта</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСобытия</Name>
							<Comment>Вид ключевого события</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ВидыКлючевыхСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Comment>Дата ключевого события</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапоминатьОСобытии</Name>
							<Comment>Напоминать о ключевом событии</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокОповещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ПериодичностьОповещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/CRM_ФормаВыбораКонтактнойИнформации/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// &НаСервереБезКонтекста
Функция ПолучитьКонтактнуюИнформацию(Контакт, Тип, ВключатьПартнера = Истина, ВключатьКонтактныхЛиц = Истина, ОдноКонтактноеЛицо = Ложь)
	
	Запрос = Новый Запрос;
	Владелец = Неопределено;
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		Владелец = Контакт;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Владелец = Контакт.Владелец;
	КонецЕсли;
	Запрос.Текст =  "ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
	|   ИСТИНА КАК ЭтоПартнер,
	|	КонтрагентыКонтактнаяИнформация.Тип,
	|	КонтрагентыКонтактнаяИнформация.Вид,
	|	КонтрагентыКонтактнаяИнформация.АдресЭП,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона,
	|	КонтрагентыКонтактнаяИнформация.Представление,
	|   КонтрагентыКонтактнаяИнформация.CRM_ОсновнойДляСвязи КАК ОсновнойВидДляСвязи,
	|	0 Порядок
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|   &ВключатьПартнера И 
	|	КонтрагентыКонтактнаяИнформация.Тип = &Тип
	|	И КонтрагентыКонтактнаяИнформация.Ссылка = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаКонтактнаяИнформация.Ссылка,
	|   Ложь, //ЭтоПартнер
	|	КонтактныеЛицаКонтактнаяИнформация.Тип,
	|	КонтактныеЛицаКонтактнаяИнформация.Вид,
	|	КонтактныеЛицаКонтактнаяИнформация.АдресЭП,
	|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона,
	|	КонтактныеЛицаКонтактнаяИнформация.Представление,
	|   КонтактныеЛицаКонтактнаяИнформация.CRM_ОсновнойДляСвязи КАК ОсновнойВидДляСвязи,
	|	1 // Порядок
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|ГДЕ
	|";
	
	Если ОдноКонтактноеЛицо И ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Запрос.Текст =  Запрос.Текст + "
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка = &Контакт И
		|";
		Запрос.УстановитьПараметр("Контакт", Контакт);
	КонецЕсли;
	
	Запрос.Текст =  Запрос.Текст + "
	|   &ВключатьКонтактныхЛиц И 
	|	КонтактныеЛицаКонтактнаяИнформация.Ссылка.Владелец = &Владелец
	|	И КонтактныеЛицаКонтактнаяИнформация.Тип = &Тип
	|ИТОГИ ПО
	|	Порядок,
	|	Ссылка";
	Запрос.УстановитьПараметр("Тип", Тип);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ВключатьПартнера", ВключатьПартнера);
	Запрос.УстановитьПараметр("ВключатьКонтактныхЛиц", ВключатьКонтактныхЛиц);
	Возврат Запрос.Выполнить();
КонецФункции

&НаКлиенте
Процедура ИзменениеПометкиПриВыбореТелефона()
	
	ТекущийЭлементДерева = Элементы.ДеревоЗначений.ТекущиеДанные;
	Пометка = ТекущийЭлементДерева.Пометка;
	
	Родитель = ТекущийЭлементДерева.ПолучитьРодителя();
	Узлы = ДеревоЗначений.ПолучитьЭлементы();
	ПометитьВсе(Ложь);
	Если Родитель = Неопределено Тогда
		Родитель = ТекущийЭлементДерева;
		Родитель.Пометка = Пометка;
		Если Пометка = Истина Тогда
			ДочерниеЭлементы = Родитель.ПолучитьЭлементы();
			ДочУзел = ДочерниеЭлементы.Получить(0);
			Если ДочУзел <> Неопределено Тогда
				ДочУзел.Пометка = Пометка;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущийЭлементДерева.Пометка = Пометка;
		Родитель.Пометка = Пометка;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция  ЗаполнитьДеревоЗначенийПоКонтрагенту(Контакт, ОдноКонтактноеЛицо = Ложь)
	
	РезультатЗапроса = Неопределено;
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		РезультатЗапроса = ПолучитьКонтактнуюИнформацию(Контакт, Тип, Истина, Истина);
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		РезультатЗапроса = ПолучитьКонтактнуюИнформацию(Контакт, Тип, Ложь, Истина, ОдноКонтактноеЛицо);
	КонецЕсли;
	
	ВыборкаПорядок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КорневыеЭлементы = ДеревоЗначений.ПолучитьЭлементы();
	
	МобильныйТелефонКонтактногоЛица = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица");
	МобильныйТелефонПользователя 	= ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя");
	
	// Порядок
	Пока ВыборкаПорядок.Следующий() Цикл
		
		ВыборкаВладельцы = ВыборкаПорядок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Ссылки конрагентов и КЛ
		Пока ВыборкаВладельцы.Следующий() Цикл
			
			ЭлементУровень0 = КорневыеЭлементы.Добавить();
			ЭлементУровень0.Контакт = ВыборкаВладельцы.Ссылка;
			
			Если ТипЗнч(ВыборкаВладельцы.Ссылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				ЭлементУровень0.Представление = ВыборкаВладельцы.Ссылка.CRM_Должность;
			КонецЕсли;
			
			ЭлементУровень0.ЭтоВладелецКонтактнойИнформации = Ложь;
			ДеревоДетальныеЗаписи = ЭлементУровень0.ПолучитьЭлементы();
			ВыборкаДетальныеЗаписи = ВыборкаВладельцы.Выбрать();
			ЭлементУровень0.ЭтоПартнер = Ложь;
			
			// Детальные записи контактной информации.
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				// проверим что это Партнер
				Если НЕ ЭлементУровень0.ЭтоПартнер И ВыборкаДетальныеЗаписи.ЭтоПартнер Тогда
					ЭлементУровень0.ЭтоПартнер = Истина;	
				КонецЕсли; 
				
				Если Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					НомерТелефона = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НомерТелефона),ВыборкаДетальныеЗаписи.НомерТелефона,ВыборкаДетальныеЗаписи.Представление);
					
					// Выводим строку только, если заполнены.
					Если ЗначениеЗаполнено(НомерТелефона) Тогда
						
						ДетальнаяЗапись = ДеревоДетальныеЗаписи.Добавить();
						ДетальнаяЗапись.Тип = ВыборкаДетальныеЗаписи.Тип;
						ДетальнаяЗапись.Вид = ВыборкаДетальныеЗаписи.Вид;
						ДетальнаяЗапись.ОсновнойВидДляСвязи = ВыборкаДетальныеЗаписи.ОсновнойВидДляСвязи;
						ДетальнаяЗапись.КонтактнаяИнформация = НомерТелефона;
						ДетальнаяЗапись.ЭтоВладелецКонтактнойИнформации = Истина;
						Представление = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Представление), ВыборкаДетальныеЗаписи.Представление, НомерТелефона);
						
						КоличествоКонтактов = КоличествоКонтактов +1;
						
						// Для того чтобы можно было отличить мобильный от обычного.
						Если ВыборкаДетальныеЗаписи.Вид = МобильныйТелефонКонтактногоЛица
							ИЛИ ВыборкаДетальныеЗаписи.Вид = МобильныйТелефонПользователя 
							Тогда
							
							ДетальнаяЗапись.Представление = Представление + НСтр("ru=' (моб.)'");
							
						Иначе
							ДетальнаяЗапись.Представление = Представление;
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					
					// Выведем адреса электронной почты.
					АдресЭП = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.АдресЭП),ВыборкаДетальныеЗаписи.АдресЭП,ВыборкаДетальныеЗаписи.Представление);
					Если ЗначениеЗаполнено(АдресЭП) Тогда
						
						ДетальнаяЗапись = ДеревоДетальныеЗаписи.Добавить();
						ДетальнаяЗапись.Тип = ВыборкаДетальныеЗаписи.Тип;
						ДетальнаяЗапись.Вид = ВыборкаДетальныеЗаписи.Вид;
						
						// Сразу отметим вид КИ, коотрый указан как "Основной для связи"
						// он будет выводиться "жирным".
						ДетальнаяЗапись.ОсновнойВидДляСвязи = ВыборкаДетальныеЗаписи.ОсновнойВидДляСвязи;
						
						ДетальнаяЗапись.КонтактнаяИнформация = ВыборкаДетальныеЗаписи.АдресЭП;
						ДетальнаяЗапись.ЭтоВладелецКонтактнойИнформации = Истина;
						Представление = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Представление),
										  ВыборкаДетальныеЗаписи.Представление,ВыборкаДетальныеЗаписи.АдресЭП);
						ДетальнаяЗапись.Представление = Представление;
						
						КоличествоКонтактов = КоличествоКонтактов +1;
						
					КонецЕсли;
				
				ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
					// Покажем адреса
					Адрес = ВыборкаДетальныеЗаписи.Представление;
					Если ЗначениеЗаполнено(Адрес) Тогда
						
						ДетальнаяЗапись = ДеревоДетальныеЗаписи.Добавить();
						ДетальнаяЗапись.Тип = ВыборкаДетальныеЗаписи.Тип;
						ДетальнаяЗапись.Вид = ВыборкаДетальныеЗаписи.Вид;
						
						// Сразу отметим вид КИ, коотрый указан как "Основной для связи"
						// он будет выводиться "жирным".
						ДетальнаяЗапись.ОсновнойВидДляСвязи = ВыборкаДетальныеЗаписи.ОсновнойВидДляСвязи;
						
						ДетальнаяЗапись.КонтактнаяИнформация = Адрес;
						ДетальнаяЗапись.ЭтоВладелецКонтактнойИнформации = Истина;
						ДетальнаяЗапись.Представление = Адрес;
						
						КоличествоКонтактов = КоличествоКонтактов +1;
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	Возврат ДеревоЗначений;
КонецФункции

&НаКлиенте
Процедура ДеревоПолучитьВсеПомеченные(Дерево, СписокРезультат)
	
	УзлыДерева = Дерево.ПолучитьЭлементы();
	
	Если УзлыДерева.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Узел Из УзлыДерева Цикл
	
		Если Узел.ЭтоВладелецКонтактнойИнформации И Узел.Пометка Тогда
			Родитель = Узел.ПолучитьРодителя();
			КонтактнаяИнформация = ?(ЗначениеЗаполнено(Узел.КонтактнаяИнформация),Узел.КонтактнаяИнформация,Узел.Представление);
			
			СтруктураЗначения = Новый Структура("Контакт, Тип, Вид");
			СтруктураЗначения.Контакт = Родитель.Контакт;
			СтруктураЗначения.Тип = Узел.Тип;
			СтруктураЗначения.Вид = Узел.Вид;
			
			СписокРезультат.Добавить(СтруктураЗначения, КонтактнаяИнформация);
			
		КонецЕсли;
		
		ДеревоПолучитьВсеПомеченные(Узел, СписокРезультат);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсе(Пометка)

	Узлы = ДеревоЗначений.ПолучитьЭлементы();
	Для каждого Узел Из Узлы Цикл
		
		Узел.Пометка = Пометка;
		УзлыКорневыхЭл = Узел.ПолучитьЭлементы();

		Для каждого УзелКорня Из УзлыКорневыхЭл Цикл
		
			УзелКорня.Пометка = Пометка;
		
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Тип = Параметры.Тип;
	Отказ1 = ?(Параметры.Свойство("Тип"),Ложь,Истина);
	Отказ2 = ?(Параметры.Свойство("Контакт"),Ложь,Истина);
	Отказ = Отказ1 ИЛИ Отказ2;
	Попытка
	
		Вид = Параметры.Вид;
	
	Исключение
		
	КонецПопытки;
	
	Если Не Отказ Тогда
		
		СписокКонтактов = Новый Массив;
		
		Если НЕ ТипЗнч(Параметры.Контакт) = Тип("Массив") Тогда
			СписокКонтактов.Добавить(Параметры.Контакт);
		Иначе
			СписокКонтактов = Параметры.Контакт;
		КонецЕсли;
		
		Для каждого Эл Из СписокКонтактов Цикл
			
			Контакт = Эл;
			Тип = Параметры.Тип;
			ЗаполнитьДеревоЗначенийПоКонтрагенту(Контакт, ?(Параметры.Свойство("ОдноКонтактноеЛицо"),Параметры.ОдноКонтактноеЛицо, Ложь));
			Если (Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И НЕ Параметры.Свойство("Вид")) ИЛИ
				Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				// Звонить можно только по одному номеру, адрес на карте можно открыть только один.
				Элементы.ДеревоЗначений.КоманднаяПанель.ПодчиненныеЭлементы.КомандаОтметитьВсе.Видимость = Ложь;
				Элементы.ДеревоЗначений.КоманднаяПанель.ПодчиненныеЭлементы.КомандаСнятьВсе.Видимость = Ложь;
				
				Заголовок = НСтр("ru = 'Форма выбора телефонного номера'");
				
			ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
				
				Заголовок = НСтр("ru = 'Форма выбора электронного адреса'");
				
			ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				
				Заголовок = НСтр("ru = 'Форма выбора адреса'");
				
			ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
				
				Заголовок = НСтр("ru = 'Форма выбора Web-страницы'");
				
			ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
				
				Заголовок = НСтр("ru = 'Форма выбора номера факса'");
				
			Иначе	
				
				Заголовок = НСтр("ru = 'Форма выбора контактной информации'");
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если КоличествоКонтактов = 1 Тогда
		СписокРезультат = Новый СписокЗначений;
		СтруктураЗначения = Новый Структура("Контакт, Тип, Вид");
		ЭлементыДерева = ДеревоЗначений.ПолучитьЭлементы();
		Родитель = ЭлементыДерева[0];
		УзлыРодителя = Родитель.ПолучитьЭлементы();
		Узел = УзлыРодителя[0];
		КонтактнаяИнформация = ?(ЗначениеЗаполнено(Узел.КонтактнаяИнформация),Узел.КонтактнаяИнформация,Узел.Представление);
		СтруктураЗначения.Контакт = Родитель.Контакт;
		СтруктураЗначения.Тип = Узел.Тип;
		СтруктураЗначения.Вид = Узел.Вид;
		СписокРезультат.Добавить(СтруктураЗначения, КонтактнаяИнформация);
		Если КлючНазначенияИспользования = "СозданиеДокументаСМС" Тогда
			ДополнительныеПараметры = Новый Структура;
			CRM_ОбщегоНазначенияКлиент.ОткрытьФормуДокументаСМС(СписокРезультат, ДополнительныеПараметры);
			Отказ = Истина;
			Закрыть();
		ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
			сфпСофтФонПроКлиент.сфпПозвонить(КонтактнаяИнформация, СтруктураЗначения.Контакт);
			Отказ = Истина;
			Закрыть();
		Иначе
			Закрыть(СписокРезультат);
		КонецЕсли;	
	ИначеЕсли КоличествоКонтактов = 0 Тогда	
		
		Если ТипЗнч(Контакт)=Тип("СправочникСсылка.Партнеры") Тогда
        Текст = НСтр("ru = 'У данного клиента не указан '") + НРег(Тип);
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		        Текст,
		        Контакт
		        );
        ИначеЕсли ТипЗнч(Контакт)=Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
                Текст = НСтр("ru = 'У данного контактного лица не указан '") + НРег(Тип);
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
    		        Текст,
    		        Контакт
   		        );
        КонецЕсли;
		
		Отказ = истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#Область ПроцедурыобработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоЗначенийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокРезультат = Новый СписокЗначений;
	СтруктураЗначения = Новый Структура("Контакт, Тип, Вид");
	
	ЭлементыДерева = ДеревоЗначений.ПолучитьЭлементы();
	Узел = Элементы.ДеревоЗначений.ТекущиеДанные;
	Родитель = Узел.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		
		Родитель = Узел;
		ЭлРодителя = Родитель.ПолучитьЭлементы();
		КолЭлРодителя = ЭлРодителя.Количество();
		
		Если КолЭлРодителя = 1 Тогда
			Узел = ЭлРодителя[0];
			КонтактнаяИнформация = ?(ЗначениеЗаполнено(Узел.КонтактнаяИнформация),Узел.КонтактнаяИнформация,Узел.Представление);
			
			СтруктураЗначения.Контакт = Родитель.Контакт;
			СтруктураЗначения.Тип = Узел.Тип;
			СтруктураЗначения.Вид = Узел.Вид;
			
			СписокРезультат.Добавить(СтруктураЗначения, КонтактнаяИнформация);
			
			Закрыть(СписокРезультат);
			
		КонецЕсли;
	Иначе
		
		КонтактнаяИнформация = ?(ЗначениеЗаполнено(Узел.КонтактнаяИнформация),Узел.КонтактнаяИнформация,Узел.Представление);
		
		СтруктураЗначения.Контакт = Родитель.Контакт;
		СтруктураЗначения.Тип = Узел.Тип;
		СтруктураЗначения.Вид = Узел.Вид;
		
		СписокРезультат.Добавить(СтруктураЗначения, КонтактнаяИнформация);
		
		Закрыть(СписокРезультат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийПометкаПриИзменении(Элемент)
	
	ТекущийЭлементДерева = Элементы.ДеревоЗначений.ТекущиеДанные;
	Родитель = ТекущийЭлементДерева.ПолучитьРодителя();
	Пометка = ТекущийЭлементДерева.Пометка;
	РадиоКнопка = ?(Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"),Истина,Ложь);
	
	Если Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") ИЛИ Вид = "СМС"  Тогда
		
		Если Родитель = Неопределено Тогда
			ПодчиненныеУзлы = ТекущийЭлементДерева.ПолучитьЭлементы();
			Для каждого Узел Из ПодчиненныеУзлы Цикл
				Узел.Пометка = Пометка;
			КонецЦикла;
		Иначе
			Родитель = ТекущийЭлементДерева.ПолучитьРодителя();
			Родитель.Пометка = Пометка;
			
		КонецЕсли;
		
	Иначе
		
		ИзменениеПометкиПриВыбореТелефона();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыобработчикиДействийКомандФормы

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	СписокРезультат = Новый СписокЗначений;
	ДеревоПолучитьВсеПомеченные(ДеревоЗначений, СписокРезультат);
	Закрыть(СписокРезультат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	ПометитьВсе(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтметитьВсе(Команда)
	ПометитьВсе(Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
